In [1]:
import pandas as pd

In [50]:
csv_operations = pd.read_csv('D:\\100 Sales Records.csv',nrows=6,usecols=[1,2,10,8,9],na_values=['2804','Russia','117.11'])
csv_operations

                 Country        Item Type  Units Sold  Unit Price  Unit Cost
0                 Tuvalu        Baby Food      9925.0      255.28     159.42
1             Bangladesh        Cosmetics         NaN      205.70        NaN
2                    NaN  Office Supplies      1779.0      651.21     524.96
3  Sao Tome and Principe           Fruits      8102.0        9.33       6.92
4                 Rwanda  Office Supplies      5062.0      651.21     524.96
5        Solomon Islands        Baby Food      2974.0      255.28     159.42

In [12]:
csv_operations.isnull().sum().sum()

2

In [16]:
csv_operations.notnull().sum().sum()

28

In [70]:
csv_operations.dropna(axis=0,how='any',thresh=1)

                 Country        Item Type  Units Sold  Unit Price  Unit Cost
0                 Tuvalu        Baby Food      9925.0      255.28     159.42
1             Bangladesh        Cosmetics         NaN      205.70        NaN
2                    NaN  Office Supplies      1779.0      651.21     524.96
3  Sao Tome and Principe           Fruits      8102.0        9.33       6.92
4                 Rwanda  Office Supplies      5062.0      651.21     524.96
5        Solomon Islands        Baby Food      2974.0      255.28     159.42

In [83]:
csv_operations.dropna(axis=0,how='any',thresh=5,inplace=True)
csv_operations

                 Country        Item Type  Units Sold  Unit Price  Unit Cost
0                 Tuvalu        Baby Food      9925.0      255.28     159.42
3  Sao Tome and Principe           Fruits      8102.0        9.33       6.92
4                 Rwanda  Office Supplies      5062.0      651.21     524.96
5        Solomon Islands        Baby Food      2974.0      255.28     159.42

In [86]:
csv_operations.dropna(subset=['Country'])
csv_operations

                 Country        Item Type  Units Sold  Unit Price  Unit Cost
0                 Tuvalu        Baby Food      9925.0      255.28     159.42
3  Sao Tome and Principe           Fruits      8102.0        9.33       6.92
4                 Rwanda  Office Supplies      5062.0      651.21     524.96
5        Solomon Islands        Baby Food      2974.0      255.28     159.42

In [84]:
csv_operations

                 Country        Item Type  Units Sold  Unit Price  Unit Cost
0                 Tuvalu        Baby Food      9925.0      255.28     159.42
3  Sao Tome and Principe           Fruits      8102.0        9.33       6.92
4                 Rwanda  Office Supplies      5062.0      651.21     524.96
5        Solomon Islands        Baby Food      2974.0      255.28     159.42

## use 'dropna' variable func to get out all the nan values from csv file

## use 'axis' paramiter to select row(0)either columns(1)

## use 'how' to defines if it removes containing 'any' of or 'all' of.

## use 'thresh' to keep minimum notnull values

## use 'subset' to analys a specific columns if that contain nan

## use 'inplace' to update file